{
  "default": {
    "party_name": "The Broken Seekers",
    "dm_name": "DM",
    "characters": [
      {
        "name": "Sha'ek Mindfa'ek",
        "player": "Player1",
        "race": "Adar (from Adar)",
        "class_name": "Cleric of Ioun",
        "description": "Battle-scarred Adaran cleric whose psionic scars glow whenever he channels Ioun's light. Sha'ek catalogues planar anomalies for Culdor Academy, doubles as the team's medic, and fights with calm, deliberate strikes that steady panicking allies.",
        "aliases": [
          "Sha'ek",
          "Shaek",
          "The Broken",
          "The Defect",
          "Mindfaek"
        ]
      },
      {
        "name": "Pipira Shimmerlock",
        "player": "Player2",
        "race": "Gnome",
        "class_name": "Wizard",
        "description": "Tinkerer-wizard whose spellbook is wrapped in copper filigree and packed with field prototypes. Pipira constantly narrates hypotheses, layers divinations over traps, and enters fights with a satchel of improvised clockwork focus stones.",
        "aliases": [
          "Pip",
          "Pipira",
          "Professor Pip"
        ]
      },
      {
        "name": "Fan'nar Khe'Lek",
        "player": "Player3",
        "race": "Winter Eladrin",
        "class_name": "Handyman/Ranger",
        "description": "Winter Eladrin scout known for silent footwork and sweeping tactical diagrams. Fan'nar tracks quarry by scent crystals embedded in their armor and alternates between flail bursts and precise cold arrow volleys when battles spread out.",
        "aliases": [
          "Pas'Ta",
          "Fan'nar",
          "The Snowblade"
        ]
      },
      {
        "name": "Furnax",
        "player": "Companion",
        "race": "Frost Hellhound",
        "class_name": "Beast Companion",
        "description": "Frost hellhound rescued from a shattered planar gate. Furnax exhales rime clouds that muffle sound, pads ahead as the party's living perimeter alarm, and only obeys shouted Adaran command words from Pip and Sha'ek.",
        "aliases": [
          "Furnax",
          "Frost Pup"
        ]
      }
    ],
    "campaign": "Gaia Adventures",
    "notes": "Recon team cataloguing Gaia's magical storms for Culdor Academy. Keeps strict field logs, rotates leadership depending on mission profile, and shuns unknown extraplanar patrons."
  },
  "team_op": {
    "party_name": "Team OP",
    "dm_name": "Jules",
    "characters": [
      {
        "name": "Sha'ek Mindfa'ek",
        "player": "Remy",
        "race": "Adar (from Adar)",
        "class_name": "Cleric of Ioun",
        "description": "Solo operative version of Sha'ek who channels greater doses of radiant power and carries a reliquary kit for single-combat rituals. He relies on delayed-burst wards, carries a planar compass, and treats every encounter like a tactical puzzle against overwhelming odds.",
        "aliases": [
          "Sha'ek",
          "Shaek",
          "The Broken",
          "The Defect",
          "Mindfaek"
        ]
      },
      {
        "name": "Pipira Shimmerlock",
        "player": "Player2",
        "race": "Gnome",
        "class_name": "Wizard",
        "description": "Pipira consults remotely for Team OP, providing arcane telemetry, prototype spell grenades, and temporary familiars pre-loaded with scouting routines.",
        "aliases": [
          "Pip",
          "Pipira",
          "Professor Pip"
        ]
      },
      {
        "name": "Fan'nar Khe'Lek",
        "player": "Player3",
        "race": "Winter Eladrin",
        "class_name": "Handyman/Ranger",
        "description": "Fan'nar acts as Sha'ek's spotter when missions escalate, projecting icy sigils that mark cover routes and maintaining a floating ledger of favors owed to Team OP.",
        "aliases": [
          "Pas'Ta",
          "Fan'nar",
          "The Snowblade"
        ]
      },
      {
        "name": "Furnax",
        "player": "Companion",
        "race": "Frost Hellhound",
        "class_name": "Beast Companion",
        "description": "Solo missions outfit Furnax with rune-branded barding that amplifies their chilling bay, letting Sha'ek lock down battlefields even without the rest of the Broken Seekers.",
        "aliases": [
          "Furnax",
          "Frost Pup"
        ]
      }
    ],
    "campaign": "Team OP Adventures",
    "notes": "Sha'ek-led strike force used for high-powered dungeon trials. Operates with heavy divination support and favors single-hero heroics backed by remote allies."
  },
  "my_campaign": {
    "party_name": "The Broken Seekers",
    "dm_name": "DM",
    "characters": [
      {
        "name": "Sha'ek Mindfa'ek",
        "player": "Player1",
        "race": "Adar (from Adar)",
        "class_name": "Cleric of Ioun",
        "description": "Field-commander Sha'ek balances protective warding with relentless advance tactics. His journals outline precise healing rotations and recorded visions from Golos that warn of temporal fractures around Gaia.",
        "aliases": [
          "Sha'ek",
          "Shaek",
          "The Broken",
          "The Defect",
          "Mindfaek"
        ]
      },
      {
        "name": "Pipira Shimmerlock",
        "player": "Player2",
        "race": "Gnome",
        "class_name": "Wizard",
        "description": "Campaign archivist for the group. Pipira sketches every artifact, builds clever sound-cancelling devices before stealth runs, and keeps a hidden codex of custom counterspell phrases.",
        "aliases": [
          "Pip",
          "Pipira",
          "Professor Pip"
        ]
      },
      {
        "name": "Fan'nar Khe'Lek",
        "player": "Player3",
        "race": "Winter Eladrin",
        "class_name": "Handyman/Ranger",
        "description": "Fan'nar moonlights as the academy's artifact courier. Their winter magic flash-freezes doorframes, and they pair a spiked flail with vine-wrapped arrows to anchor foes in place for Sha'ek's channeling.",
        "aliases": [
          "Pas'Ta",
          "Fan'nar",
          "The Snowblade"
        ]
      },
      {
        "name": "Furnax",
        "player": "Companion",
        "race": "Frost Hellhound",
        "class_name": "Beast Companion",
        "description": "Furnax's howl can etch hoarfrost circles that double as teleport beacons for the rest of the pack. The companion responds to treats stored in Pipira's bandolier and marks enemies with scent tags visible through Sha'ek's visor.",
        "aliases": [
          "Furnax",
          "Frost Pup"
        ]
      }
    ],
    "campaign": "Gaia Adventures",
    "notes": "Variant roster used when adapting Gaia Adventures to home campaigns. Encourages experimentation with artifact-driven objectives and cross-faction alliances."
  }
}
